GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_pwm.h
/****************************************************************************
 * arch/arm/src/gd32e11x/gd32e11x_pwm.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_GD32E11X_GD32E11X_PWM_H
#define __ARCH_ARM_SRC_GD32E11X_GD32E11X_PWM_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <nuttx/timers/pwm.h>

#include "chip.h"
#include "hardware/gd32e11x_timer.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* Timer devices may be used for different purposes.  Such special purposes
 * include use as a PWM output.  Each timer that is used for PWM must be
 * enabled and a Kconfig option must exist for each timer to select its use
 * for PWM.
 *
 * CONFIG_GD32E11X_TIMERn_PWM      - Enables PWM for TIMERn
 * CONFIG_GD32E11X_TIMERn_CHANNELx - Enables channel x for TIMERn
 * CONFIG_GD32E11X_TIMERn_CHxO     - Enables main output for channel x
 * CONFIG_GD32E11X_TIMERn_CHxON    - Enables complementary output for ch x
 * CONFIG_GD32E11X_TIMERn_CHxMODE  - Channel x compare output mode
 * CONFIG_GD32E11X_TIMERn_CHxP     - Output polarity for channel x
 * CONFIG_GD32E11X_TIMERn_CHxIDLE  - Idle state for channel x
 * CONFIG_GD32E11X_TIMERn_CHxNP    - Complementary output polarity
 * CONFIG_GD32E11X_TIMERn_CHxNIDLE - Complementary idle state
 * CONFIG_GD32E11X_TIMERn_BREAK    - Break input enable
 * CONFIG_GD32E11X_TIMERn_BRKP     - Break polarity
 * CONFIG_GD32E11X_TIMERn_DEADTIME - Dead-time value
 * CONFIG_GD32E11X_TIMERn_FDTS     - Dead-time clock division (CKDIV)
 * CONFIG_GD32E11X_TIMERn_MODE     - Timer counting mode
 * CONFIG_GD32E11X_TIMERn_LOCK     - Register lock level
 * CONFIG_GD32E11X_PWM_TRGO        - TRGO synchronization support
 * CONFIG_GD32E11X_PWM_LL_OPS      - Low-level operations support
 */

/* Timer types **************************************************************/

#define GD32_TIMER_TYPE_BASIC         0  /* Basic timer (TIMER5-6, no channels) */
#define GD32_TIMER_TYPE_GENERAL16     1  /* General 16-bit timer (TIMER1-4) */
#define GD32_TIMER_TYPE_GENERAL16_2CH 2  /* General 16-bit timer with 2 channels (TIMER8, TIMER11) */
#define GD32_TIMER_TYPE_GENERAL16_1CH 3  /* General 16-bit timer with 1 channel (TIMER9-10, TIMER12-13) */
#define GD32_TIMER_TYPE_ADVANCED      4  /* Advanced timer (TIMER0, TIMER7) */

/* Map timer types to specific timers */

#define GD32_TIMER0_TYPE         GD32_TIMER_TYPE_ADVANCED
#define GD32_TIMER1_TYPE         GD32_TIMER_TYPE_GENERAL16
#define GD32_TIMER2_TYPE         GD32_TIMER_TYPE_GENERAL16
#define GD32_TIMER3_TYPE         GD32_TIMER_TYPE_GENERAL16
#define GD32_TIMER4_TYPE         GD32_TIMER_TYPE_GENERAL16
#define GD32_TIMER5_TYPE         GD32_TIMER_TYPE_BASIC
#define GD32_TIMER6_TYPE         GD32_TIMER_TYPE_BASIC
#define GD32_TIMER7_TYPE         GD32_TIMER_TYPE_ADVANCED
#define GD32_TIMER8_TYPE         GD32_TIMER_TYPE_GENERAL16_2CH
#define GD32_TIMER9_TYPE         GD32_TIMER_TYPE_GENERAL16_1CH
#define GD32_TIMER10_TYPE        GD32_TIMER_TYPE_GENERAL16_1CH
#define GD32_TIMER11_TYPE        GD32_TIMER_TYPE_GENERAL16_2CH
#define GD32_TIMER12_TYPE        GD32_TIMER_TYPE_GENERAL16_1CH
#define GD32_TIMER13_TYPE        GD32_TIMER_TYPE_GENERAL16_1CH

/* Check if timer is an advanced timer */

#define GD32_TIMER_IS_ADVANCED(timer_type) \
        ((timer_type) == GD32_TIMER_TYPE_ADVANCED)

/* Maximum number of PWM channels per timer */

#define PWM_MAX_CHANNELS          4

/* Timer clock input ********************************************************/

/* When APB prescaler is > 1, timer clock is 2x the APB clock */

#ifndef GD32_APB1_TIMER_CLKIN
#  define GD32_APB1_TIMER_CLKIN   (2 * GD32_PCLK1_FREQUENCY)
#endif

#ifndef GD32_APB2_TIMER_CLKIN
#  define GD32_APB2_TIMER_CLKIN   (2 * GD32_PCLK2_FREQUENCY)
#endif

/* Per-timer clock frequency.
 * APB2: TIMER0, 7-10
 * APB1: TIMER1-6, 11-13
 */

#define GD32_TIMER0_CLKIN          GD32_APB2_TIMER_CLKIN
#define GD32_TIMER1_CLKIN          GD32_APB1_TIMER_CLKIN
#define GD32_TIMER2_CLKIN          GD32_APB1_TIMER_CLKIN
#define GD32_TIMER3_CLKIN          GD32_APB1_TIMER_CLKIN
#define GD32_TIMER4_CLKIN          GD32_APB1_TIMER_CLKIN
#define GD32_TIMER5_CLKIN          GD32_APB1_TIMER_CLKIN
#define GD32_TIMER6_CLKIN          GD32_APB1_TIMER_CLKIN
#define GD32_TIMER7_CLKIN          GD32_APB2_TIMER_CLKIN
#define GD32_TIMER8_CLKIN          GD32_APB2_TIMER_CLKIN
#define GD32_TIMER9_CLKIN          GD32_APB2_TIMER_CLKIN
#define GD32_TIMER10_CLKIN         GD32_APB2_TIMER_CLKIN
#define GD32_TIMER11_CLKIN         GD32_APB1_TIMER_CLKIN
#define GD32_TIMER12_CLKIN         GD32_APB1_TIMER_CLKIN
#define GD32_TIMER13_CLKIN         GD32_APB1_TIMER_CLKIN

/* Complementary output support *********************************************/

/* TIMER0 complementary outputs */

#if defined(CONFIG_GD32E11X_TIMER0_CH0ON) || \
    defined(CONFIG_GD32E11X_TIMER0_CH1ON) || \
    defined(CONFIG_GD32E11X_TIMER0_CH2ON)
#  define HAVE_TIMER0_COMPLEMENTARY
#endif

/* TIMER7 complementary outputs */

#if defined(CONFIG_GD32E11X_TIMER7_CH0ON) || \
    defined(CONFIG_GD32E11X_TIMER7_CH1ON) || \
    defined(CONFIG_GD32E11X_TIMER7_CH2ON)
#  define HAVE_TIMER7_COMPLEMENTARY
#endif

#if defined(HAVE_TIMER0_COMPLEMENTARY) || defined(HAVE_TIMER7_COMPLEMENTARY)
#  define HAVE_PWM_COMPLEMENTARY
#endif

/* Break support ************************************************************/

#if defined(CONFIG_GD32E11X_TIMER0_BREAK) || \
    defined(CONFIG_GD32E11X_TIMER7_BREAK)
#  define HAVE_BREAK
#endif

/* TRGO synchronization support *********************************************/

#ifdef CONFIG_GD32E11X_PWM_TRGO
#  define HAVE_TRGO
#endif

/* PWM channel GPIO configuration macros ************************************
 *
 * These macros map Kconfig output enables to GPIO pin configurations.
 * If the output is enabled in Kconfig, the corresponding GPIO pin
 * definition from the pinmap header is used; otherwise 0.
 */

/* TIMER0 channel output configurations */

#ifdef CONFIG_GD32E11X_TIMER0_CH0O
#  define PWM_TIMER0_CH0CFG  GPIO_TIMER0_CH0OUT_0
#else
#  define PWM_TIMER0_CH0CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER0_CH0ON
#  define PWM_TIMER0_CH0NCFG GPIO_TIMER0_CH0OUTN_0
#else
#  define PWM_TIMER0_CH0NCFG 0
#endif
#ifdef CONFIG_GD32E11X_TIMER0_CH1O
#  define PWM_TIMER0_CH1CFG  GPIO_TIMER0_CH1OUT_0
#else
#  define PWM_TIMER0_CH1CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER0_CH1ON
#  define PWM_TIMER0_CH1NCFG GPIO_TIMER0_CH1OUTN_0
#else
#  define PWM_TIMER0_CH1NCFG 0
#endif
#ifdef CONFIG_GD32E11X_TIMER0_CH2O
#  define PWM_TIMER0_CH2CFG  GPIO_TIMER0_CH2OUT_0
#else
#  define PWM_TIMER0_CH2CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER0_CH2ON
#  define PWM_TIMER0_CH2NCFG GPIO_TIMER0_CH2OUTN_0
#else
#  define PWM_TIMER0_CH2NCFG 0
#endif
#ifdef CONFIG_GD32E11X_TIMER0_CH3O
#  define PWM_TIMER0_CH3CFG  GPIO_TIMER0_CH3OUT_0
#else
#  define PWM_TIMER0_CH3CFG  0
#endif

/* TIMER1 channel output configurations */

#ifdef CONFIG_GD32E11X_TIMER1_CH0O
#  define PWM_TIMER1_CH0CFG  GPIO_TIMER1_CH0OUT_0
#else
#  define PWM_TIMER1_CH0CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER1_CH1O
#  define PWM_TIMER1_CH1CFG  GPIO_TIMER1_CH1OUT_0
#else
#  define PWM_TIMER1_CH1CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER1_CH2O
#  define PWM_TIMER1_CH2CFG  GPIO_TIMER1_CH2OUT_0
#else
#  define PWM_TIMER1_CH2CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER1_CH3O
#  define PWM_TIMER1_CH3CFG  GPIO_TIMER1_CH3OUT_0
#else
#  define PWM_TIMER1_CH3CFG  0
#endif

/* TIMER2 channel output configurations */

