GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_pwm.h
#ifdef CONFIG_GD32E11X_TIMER2_CH0O
#  define PWM_TIMER2_CH0CFG  GPIO_TIMER2_CH0OUT_0
#else
#  define PWM_TIMER2_CH0CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER2_CH1O
#  define PWM_TIMER2_CH1CFG  GPIO_TIMER2_CH1OUT_0
#else
#  define PWM_TIMER2_CH1CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER2_CH2O
#  define PWM_TIMER2_CH2CFG  GPIO_TIMER2_CH2OUT_0
#else
#  define PWM_TIMER2_CH2CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER2_CH3O
#  define PWM_TIMER2_CH3CFG  GPIO_TIMER2_CH3OUT_0
#else
#  define PWM_TIMER2_CH3CFG  0
#endif

/* TIMER3 channel output configurations */

#ifdef CONFIG_GD32E11X_TIMER3_CH0O
#  define PWM_TIMER3_CH0CFG  GPIO_TIMER3_CH0OUT_0
#else
#  define PWM_TIMER3_CH0CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER3_CH1O
#  define PWM_TIMER3_CH1CFG  GPIO_TIMER3_CH1OUT_0
#else
#  define PWM_TIMER3_CH1CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER3_CH2O
#  define PWM_TIMER3_CH2CFG  GPIO_TIMER3_CH2OUT_0
#else
#  define PWM_TIMER3_CH2CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER3_CH3O
#  define PWM_TIMER3_CH3CFG  GPIO_TIMER3_CH3OUT_0
#else
#  define PWM_TIMER3_CH3CFG  0
#endif

/* TIMER4 channel output configurations */

#ifdef CONFIG_GD32E11X_TIMER4_CH0O
#  define PWM_TIMER4_CH0CFG  GPIO_TIMER4_CH0OUT_0
#else
#  define PWM_TIMER4_CH0CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER4_CH1O
#  define PWM_TIMER4_CH1CFG  GPIO_TIMER4_CH1OUT_0
#else
#  define PWM_TIMER4_CH1CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER4_CH2O
#  define PWM_TIMER4_CH2CFG  GPIO_TIMER4_CH2OUT_0
#else
#  define PWM_TIMER4_CH2CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER4_CH3O
#  define PWM_TIMER4_CH3CFG  GPIO_TIMER4_CH3OUT_0
#else
#  define PWM_TIMER4_CH3CFG  0
#endif

/* TIMER7 channel output configurations */

#ifdef CONFIG_GD32E11X_TIMER7_CH0O
#  define PWM_TIMER7_CH0CFG  GPIO_TIMER7_CH0OUT_0
#else
#  define PWM_TIMER7_CH0CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER7_CH0ON
#  define PWM_TIMER7_CH0NCFG GPIO_TIMER7_CH0OUTN_0
#else
#  define PWM_TIMER7_CH0NCFG 0
#endif
#ifdef CONFIG_GD32E11X_TIMER7_CH1O
#  define PWM_TIMER7_CH1CFG  GPIO_TIMER7_CH1OUT_0
#else
#  define PWM_TIMER7_CH1CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER7_CH1ON
#  define PWM_TIMER7_CH1NCFG GPIO_TIMER7_CH1OUTN_0
#else
#  define PWM_TIMER7_CH1NCFG 0
#endif
#ifdef CONFIG_GD32E11X_TIMER7_CH2O
#  define PWM_TIMER7_CH2CFG  GPIO_TIMER7_CH2OUT_0
#else
#  define PWM_TIMER7_CH2CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER7_CH2ON
#  define PWM_TIMER7_CH2NCFG GPIO_TIMER7_CH2OUTN_0
#else
#  define PWM_TIMER7_CH2NCFG 0
#endif
#ifdef CONFIG_GD32E11X_TIMER7_CH3O
#  define PWM_TIMER7_CH3CFG  GPIO_TIMER7_CH3OUT_0
#else
#  define PWM_TIMER7_CH3CFG  0
#endif

/* TIMER8 channel output configurations (2 channels) */

#ifdef CONFIG_GD32E11X_TIMER8_CH0O
#  define PWM_TIMER8_CH0CFG  GPIO_TIMER8_CH0OUT_0
#else
#  define PWM_TIMER8_CH0CFG  0
#endif
#ifdef CONFIG_GD32E11X_TIMER8_CH1O
#  define PWM_TIMER8_CH1CFG  GPIO_TIMER8_CH1OUT_0
#else
#  define PWM_TIMER8_CH1CFG  0
#endif

/* TIMER9 channel output configurations (1 channel) */

#ifdef CONFIG_GD32E11X_TIMER9_CH0O
#  define PWM_TIMER9_CH0CFG  GPIO_TIMER9_CH0OUT_0
#else
#  define PWM_TIMER9_CH0CFG  0
#endif

/* TIMER10 channel output configurations (1 channel) */

#ifdef CONFIG_GD32E11X_TIMER10_CH0O
#  define PWM_TIMER10_CH0CFG GPIO_TIMER10_CH0OUT_0
#else
#  define PWM_TIMER10_CH0CFG 0
#endif

/* TIMER11 channel output configurations (2 channels) */

#ifdef CONFIG_GD32E11X_TIMER11_CH0O
#  define PWM_TIMER11_CH0CFG GPIO_TIMER11_CH0OUT_0
#else
#  define PWM_TIMER11_CH0CFG 0
#endif
#ifdef CONFIG_GD32E11X_TIMER11_CH1O
#  define PWM_TIMER11_CH1CFG GPIO_TIMER11_CH1OUT_0
#else
#  define PWM_TIMER11_CH1CFG 0
#endif

/* TIMER12 channel output configurations (1 channel) */

#ifdef CONFIG_GD32E11X_TIMER12_CH0O
#  define PWM_TIMER12_CH0CFG GPIO_TIMER12_CH0OUT_0
#else
#  define PWM_TIMER12_CH0CFG 0
#endif

/* TIMER13 channel output configurations (1 channel) */

#ifdef CONFIG_GD32E11X_TIMER13_CH0O
#  define PWM_TIMER13_CH0CFG GPIO_TIMER13_CH0OUT_0
#else
#  define PWM_TIMER13_CH0CFG 0
#endif

/****************************************************************************
 * PWM channel count macros
 *
 * These macros count the number of configured channels per timer.
 * Each CONFIG_GD32E11X_TIMERn_CHANNELx maps to 0 or 1 and the sum
 * produces the total number of configured channels.
 ****************************************************************************/

/* TIMER0 - Advanced, 4 channels */

#ifdef CONFIG_GD32E11X_TIMER0_CHANNEL0
#  define PWM_TIMER0_CHANNEL0 1
#else
#  define PWM_TIMER0_CHANNEL0 0
#endif
#ifdef CONFIG_GD32E11X_TIMER0_CHANNEL1
#  define PWM_TIMER0_CHANNEL1 1
#else
#  define PWM_TIMER0_CHANNEL1 0
#endif
#ifdef CONFIG_GD32E11X_TIMER0_CHANNEL2
#  define PWM_TIMER0_CHANNEL2 1
#else
#  define PWM_TIMER0_CHANNEL2 0
#endif
#ifdef CONFIG_GD32E11X_TIMER0_CHANNEL3
#  define PWM_TIMER0_CHANNEL3 1
#else
#  define PWM_TIMER0_CHANNEL3 0
#endif
#define PWM_TIMER0_NCHANNELS (PWM_TIMER0_CHANNEL0 + PWM_TIMER0_CHANNEL1 + \
                              PWM_TIMER0_CHANNEL2 + PWM_TIMER0_CHANNEL3)

/* TIMER1 - General, 4 channels */

#ifdef CONFIG_GD32E11X_TIMER1_CHANNEL0
#  define PWM_TIMER1_CHANNEL0 1
#else
#  define PWM_TIMER1_CHANNEL0 0
#endif
#ifdef CONFIG_GD32E11X_TIMER1_CHANNEL1
#  define PWM_TIMER1_CHANNEL1 1
#else
#  define PWM_TIMER1_CHANNEL1 0
#endif
#ifdef CONFIG_GD32E11X_TIMER1_CHANNEL2
#  define PWM_TIMER1_CHANNEL2 1
#else
#  define PWM_TIMER1_CHANNEL2 0
#endif
#ifdef CONFIG_GD32E11X_TIMER1_CHANNEL3
#  define PWM_TIMER1_CHANNEL3 1
#else
#  define PWM_TIMER1_CHANNEL3 0
#endif
#define PWM_TIMER1_NCHANNELS (PWM_TIMER1_CHANNEL0 + PWM_TIMER1_CHANNEL1 + \
                              PWM_TIMER1_CHANNEL2 + PWM_TIMER1_CHANNEL3)

/* TIMER2 - General, 4 channels */

#ifdef CONFIG_GD32E11X_TIMER2_CHANNEL0
#  define PWM_TIMER2_CHANNEL0 1
#else
#  define PWM_TIMER2_CHANNEL0 0
#endif
#ifdef CONFIG_GD32E11X_TIMER2_CHANNEL1
#  define PWM_TIMER2_CHANNEL1 1
#else
#  define PWM_TIMER2_CHANNEL1 0
#endif
#ifdef CONFIG_GD32E11X_TIMER2_CHANNEL2
#  define PWM_TIMER2_CHANNEL2 1
#else
#  define PWM_TIMER2_CHANNEL2 0
#endif
#ifdef CONFIG_GD32E11X_TIMER2_CHANNEL3
#  define PWM_TIMER2_CHANNEL3 1
#else
#  define PWM_TIMER2_CHANNEL3 0
#endif
#define PWM_TIMER2_NCHANNELS (PWM_TIMER2_CHANNEL0 + PWM_TIMER2_CHANNEL1 + \
                              PWM_TIMER2_CHANNEL2 + PWM_TIMER2_CHANNEL3)

/* TIMER3 - General, 4 channels */

