GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_pwm.h
#ifdef CONFIG_GD32E11X_TIMER3_CHANNEL0
#  define PWM_TIMER3_CHANNEL0 1
#else
#  define PWM_TIMER3_CHANNEL0 0
#endif
#ifdef CONFIG_GD32E11X_TIMER3_CHANNEL1
#  define PWM_TIMER3_CHANNEL1 1
#else
#  define PWM_TIMER3_CHANNEL1 0
#endif
#ifdef CONFIG_GD32E11X_TIMER3_CHANNEL2
#  define PWM_TIMER3_CHANNEL2 1
#else
#  define PWM_TIMER3_CHANNEL2 0
#endif
#ifdef CONFIG_GD32E11X_TIMER3_CHANNEL3
#  define PWM_TIMER3_CHANNEL3 1
#else
#  define PWM_TIMER3_CHANNEL3 0
#endif
#define PWM_TIMER3_NCHANNELS (PWM_TIMER3_CHANNEL0 + PWM_TIMER3_CHANNEL1 + \
                              PWM_TIMER3_CHANNEL2 + PWM_TIMER3_CHANNEL3)

/* TIMER4 - General, 4 channels */

#ifdef CONFIG_GD32E11X_TIMER4_CHANNEL0
#  define PWM_TIMER4_CHANNEL0 1
#else
#  define PWM_TIMER4_CHANNEL0 0
#endif
#ifdef CONFIG_GD32E11X_TIMER4_CHANNEL1
#  define PWM_TIMER4_CHANNEL1 1
#else
#  define PWM_TIMER4_CHANNEL1 0
#endif
#ifdef CONFIG_GD32E11X_TIMER4_CHANNEL2
#  define PWM_TIMER4_CHANNEL2 1
#else
#  define PWM_TIMER4_CHANNEL2 0
#endif
#ifdef CONFIG_GD32E11X_TIMER4_CHANNEL3
#  define PWM_TIMER4_CHANNEL3 1
#else
#  define PWM_TIMER4_CHANNEL3 0
#endif
#define PWM_TIMER4_NCHANNELS (PWM_TIMER4_CHANNEL0 + PWM_TIMER4_CHANNEL1 + \
                              PWM_TIMER4_CHANNEL2 + PWM_TIMER4_CHANNEL3)

/* TIMER7 - Advanced, 4 channels */

#ifdef CONFIG_GD32E11X_TIMER7_CHANNEL0
#  define PWM_TIMER7_CHANNEL0 1
#else
#  define PWM_TIMER7_CHANNEL0 0
#endif
#ifdef CONFIG_GD32E11X_TIMER7_CHANNEL1
#  define PWM_TIMER7_CHANNEL1 1
#else
#  define PWM_TIMER7_CHANNEL1 0
#endif
#ifdef CONFIG_GD32E11X_TIMER7_CHANNEL2
#  define PWM_TIMER7_CHANNEL2 1
#else
#  define PWM_TIMER7_CHANNEL2 0
#endif
#ifdef CONFIG_GD32E11X_TIMER7_CHANNEL3
#  define PWM_TIMER7_CHANNEL3 1
#else
#  define PWM_TIMER7_CHANNEL3 0
#endif
#define PWM_TIMER7_NCHANNELS (PWM_TIMER7_CHANNEL0 + PWM_TIMER7_CHANNEL1 + \
                              PWM_TIMER7_CHANNEL2 + PWM_TIMER7_CHANNEL3)

/* TIMER8 - General, 2 channels */

#ifdef CONFIG_GD32E11X_TIMER8_CHANNEL0
#  define PWM_TIMER8_CHANNEL0 1
#else
#  define PWM_TIMER8_CHANNEL0 0
#endif
#ifdef CONFIG_GD32E11X_TIMER8_CHANNEL1
#  define PWM_TIMER8_CHANNEL1 1
#else
#  define PWM_TIMER8_CHANNEL1 0
#endif
#define PWM_TIMER8_NCHANNELS (PWM_TIMER8_CHANNEL0 + PWM_TIMER8_CHANNEL1)

/* TIMER9 - General, 1 channel */

#ifdef CONFIG_GD32E11X_TIMER9_CHANNEL0
#  define PWM_TIMER9_CHANNEL0 1
#else
#  define PWM_TIMER9_CHANNEL0 0
#endif
#define PWM_TIMER9_NCHANNELS  (PWM_TIMER9_CHANNEL0)

/* TIMER10 - General, 1 channel */

#ifdef CONFIG_GD32E11X_TIMER10_CHANNEL0
#  define PWM_TIMER10_CHANNEL0 1
#else
#  define PWM_TIMER10_CHANNEL0 0
#endif
#define PWM_TIMER10_NCHANNELS (PWM_TIMER10_CHANNEL0)

/* TIMER11 - General, 2 channels */

#ifdef CONFIG_GD32E11X_TIMER11_CHANNEL0
#  define PWM_TIMER11_CHANNEL0 1
#else
#  define PWM_TIMER11_CHANNEL0 0
#endif
#ifdef CONFIG_GD32E11X_TIMER11_CHANNEL1
#  define PWM_TIMER11_CHANNEL1 1
#else
#  define PWM_TIMER11_CHANNEL1 0
#endif
#define PWM_TIMER11_NCHANNELS (PWM_TIMER11_CHANNEL0 + PWM_TIMER11_CHANNEL1)

/* TIMER12 - General, 1 channel */

#ifdef CONFIG_GD32E11X_TIMER12_CHANNEL0
#  define PWM_TIMER12_CHANNEL0 1
#else
#  define PWM_TIMER12_CHANNEL0 0
#endif
#define PWM_TIMER12_NCHANNELS (PWM_TIMER12_CHANNEL0)

/* TIMER13 - General, 1 channel */

#ifdef CONFIG_GD32E11X_TIMER13_CHANNEL0
#  define PWM_TIMER13_CHANNEL0 1
#else
#  define PWM_TIMER13_CHANNEL0 0
#endif
#define PWM_TIMER13_NCHANNELS (PWM_TIMER13_CHANNEL0)

/* Low-level ops helpers ****************************************************/

#ifdef CONFIG_GD32E11X_PWM_LL_OPS

/* NOTE:
 * Low-level ops accept pwm_lowerhalf_s as first argument, but llops access
 * can be found in gd32_pwm_dev_s.
 * These macros use GD32 register naming conventions:
 *   CHxCV - Channel Compare Value
 *   CAR   - Counter Auto-Reload
 *   CREP  - Counter Repetition
 */

#define PWM_SETUP(dev)                                                       \
        (dev)->ops->setup((struct pwm_lowerhalf_s *)dev)
#define PWM_SHUTDOWN(dev)                                                    \
        (dev)->ops->shutdown((struct pwm_lowerhalf_s *)dev)
#define PWM_CHCV_UPDATE(dev, index, chcv)                                    \
        ((struct gd32_pwm_dev_s *)dev)->llops->chcv_update(                  \
                (struct pwm_lowerhalf_s *)dev, index, chcv)
#define PWM_MODE_UPDATE(dev, index, mode)                                    \
        ((struct gd32_pwm_dev_s *)dev)->llops->mode_update(                  \
                (struct pwm_lowerhalf_s *)dev, index, mode)
#define PWM_CHCV_GET(dev, index)                                             \
        ((struct gd32_pwm_dev_s *)dev)->llops->chcv_get(                     \
                (struct pwm_lowerhalf_s *)dev, index)
#define PWM_CAR_UPDATE(dev, car)                                             \
        ((struct gd32_pwm_dev_s *)dev)->llops->car_update(                   \
                (struct pwm_lowerhalf_s *)dev, car)
#define PWM_CAR_GET(dev)                                                     \
        ((struct gd32_pwm_dev_s *)dev)->llops->car_get(                      \
                (struct pwm_lowerhalf_s *)dev)
#define PWM_CREP_UPDATE(dev, crep)                                           \
        ((struct gd32_pwm_dev_s *)dev)->llops->crep_update(                  \
                (struct pwm_lowerhalf_s *)dev, crep)
#define PWM_CREP_GET(dev)                                                    \
        ((struct gd32_pwm_dev_s *)dev)->llops->crep_get(                     \
                (struct pwm_lowerhalf_s *)dev)
#ifdef HAVE_TRGO
#  define PWM_TRGO_SET(dev, trgo)                                            \
        ((struct gd32_pwm_dev_s *)dev)->llops->trgo_set(                     \
                (struct pwm_lowerhalf_s *)dev, trgo)
#endif
#define PWM_OUTPUTS_ENABLE(dev, out, state)                                  \
        ((struct gd32_pwm_dev_s *)dev)->llops->outputs_enable(               \
                (struct pwm_lowerhalf_s *)dev, out, state)
#define PWM_SOFT_UPDATE(dev)                                                 \
        ((struct gd32_pwm_dev_s *)dev)->llops->soft_update(                  \
                (struct pwm_lowerhalf_s *)dev)
#define PWM_CONFIGURE(dev)                                                   \
        ((struct gd32_pwm_dev_s *)dev)->llops->configure(                    \
                (struct pwm_lowerhalf_s *)dev)
#define PWM_SOFT_BREAK(dev, state)                                           \
        ((struct gd32_pwm_dev_s *)dev)->llops->soft_break(                   \
                (struct pwm_lowerhalf_s *)dev, state)
#define PWM_FREQ_UPDATE(dev, freq)                                           \
        ((struct gd32_pwm_dev_s *)dev)->llops->freq_update(                  \
                (struct pwm_lowerhalf_s *)dev, freq)
#define PWM_TIMER_ENABLE(dev, state)                                         \
        ((struct gd32_pwm_dev_s *)dev)->llops->enable(                       \
                (struct pwm_lowerhalf_s *)dev, state)
#ifdef CONFIG_DEBUG_PWM_INFO
#  define PWM_DUMP_REGS(dev, msg)                                            \
        ((struct gd32_pwm_dev_s *)dev)->llops->dumpregs(                     \
                (struct pwm_lowerhalf_s *)dev, msg)
#else
#  define PWM_DUMP_REGS(dev, msg)
#endif
#ifdef HAVE_PWM_COMPLEMENTARY
#  define PWM_DT_UPDATE(dev, dt)                                             \
        ((struct gd32_pwm_dev_s *)dev)->llops->dt_update(                    \
                (struct pwm_lowerhalf_s *)dev, dt)
#endif

