GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_pwm.h
#endif /* CONFIG_GD32E11X_PWM_LL_OPS */

/****************************************************************************
 * Public Types
 ****************************************************************************/

#ifndef __ASSEMBLY__

/* Timer mode values (counting direction) */

enum gd32_pwm_timer_mode_e
{
        GD32_PWM_TIMER_MODE_COUNTUP      = 0, /* Edge-aligned, up counting */
        GD32_PWM_TIMER_MODE_COUNTDOWN    = 1, /* Edge-aligned, down counting */
        GD32_PWM_TIMER_MODE_CENTER_DOWN  = 2, /* Center-aligned, down counting trigger */
        GD32_PWM_TIMER_MODE_CENTER_UP    = 3, /* Center-aligned, up counting trigger */
        GD32_PWM_TIMER_MODE_CENTER_BOTH  = 4, /* Center-aligned, both direction trigger */
};

/* Channel mode values (output compare mode)
 * Reference: GD32 TIMER_OC_MODE definitions in gd32e113_timer.h
 * Maps to CHxCOMCTL[6:4] bits in CHCTLx register (values 0-7)
 */

enum gd32_pwm_chanmode_e
{
  GD32_CHANMODE_TIMING    = 0,  /* Timing mode - no effect on outputs */
  GD32_CHANMODE_ACTIVE    = 1,  /* Active on match */
  GD32_CHANMODE_INACTIVE  = 2,  /* Inactive on match */
  GD32_CHANMODE_TOGGLE    = 3,  /* Toggle on match */
  GD32_CHANMODE_FORCE_LO  = 4,  /* Force low */
  GD32_CHANMODE_FORCE_HI  = 5,  /* Force high */
  GD32_CHANMODE_PWM0      = 6,  /* PWM mode 0 (active when CNT < CHxCV) */
  GD32_CHANMODE_PWM1      = 7,  /* PWM mode 1 (active when CNT >= CHxCV) */
};

/* Output polarity */

enum gd32_pwm_pol_e
{
  GD32_POL_ACTIVE_HIGH    = 0,  /* Active high polarity */
  GD32_POL_ACTIVE_LOW     = 1,  /* Active low polarity */
};

/* Idle state */

enum gd32_pwm_idle_e
{
  GD32_IDLE_INACTIVE      = 0,  /* Inactive during idle */
  GD32_IDLE_ACTIVE        = 1,  /* Active during idle */
};

/* PWM timer channel numbers (0-based indexing per GD32 convention) */

enum gd32_pwm_chan_e
{
  GD32_PWM_CHAN0  = 0,
  GD32_PWM_CHAN1  = 1,
  GD32_PWM_CHAN2  = 2,
  GD32_PWM_CHAN3  = 3,
};

/* PWM timer channel output bit flags.
 * Used with pwm_outputs_enable() to control specific outputs.
 * For advanced timers (TIMER0/7), complementary outputs (CHxON) exist
 * only for channels 0-2.
 */

enum gd32_pwm_output_e
{
  GD32_PWM_OUT0   = (1 << 0),   /* CH0 output */
  GD32_PWM_OUT0N  = (1 << 1),   /* CH0 complementary output (advanced only) */
  GD32_PWM_OUT1   = (1 << 2),   /* CH1 output */
  GD32_PWM_OUT1N  = (1 << 3),   /* CH1 complementary output (advanced only) */
  GD32_PWM_OUT2   = (1 << 4),   /* CH2 output */
  GD32_PWM_OUT2N  = (1 << 5),   /* CH2 complementary output (advanced only) */
  GD32_PWM_OUT3   = (1 << 6),   /* CH3 output (no complementary) */

  /* Bit 7 reserved - CH3 has no complementary output */
};

/* PWM output configuration */

struct gd32_pwm_out_s
{
  uint8_t  in_use : 1;          /* Output is in use */
  uint8_t  pol    : 1;          /* Output polarity */
  uint8_t  idle   : 1;          /* Idle state */
  uint8_t  _res   : 5;          /* Reserved */
  uint32_t pincfg;              /* GPIO pin configuration */
};

/* PWM break configuration (advanced timers only) */

#ifdef HAVE_BREAK
struct gd32_pwm_break_s
{
  uint8_t  en   : 1;            /* Break enable */
  uint8_t  pol  : 1;            /* Break polarity (0=active low, 1=active high) */
  uint8_t  _res : 6;            /* Reserved */
};
#endif

/* PWM channel configuration */

struct gd32_pwmchan_s
{
  uint8_t                channel : 4;  /* Timer channel number: {0..3} */
  uint8_t                mode    : 4;  /* Channel mode (see chanmode_e) */
  struct gd32_pwm_out_s  out1;         /* PWM main output */
#ifdef HAVE_PWM_COMPLEMENTARY
  struct gd32_pwm_out_s  out2;         /* PWM complementary output */
#endif
};

/* PWM timer state structure (opaque - defined in .c file) */

struct gd32_pwmtimer_s;

#ifdef CONFIG_GD32E11X_PWM_LL_OPS
/****************************************************************************
 * Low-level Operations
 *
 * This structure provides low-level access to the timer registers for
 * advanced usage scenarios.
 ****************************************************************************/

struct gd32_pwm_ops_s
{
  /* Update CHxCV (channel compare value) register */

  int (*chcv_update)(struct pwm_lowerhalf_s *dev, uint8_t index,
                     uint32_t chcv);

  /* Update channel output compare mode */

  int (*mode_update)(struct pwm_lowerhalf_s *dev, uint8_t index,
                     uint32_t mode);

  /* Get current CHxCV value */

  uint32_t (*chcv_get)(struct pwm_lowerhalf_s *dev, uint8_t index);

  /* Update CAR (counter auto-reload) register */

  int (*car_update)(struct pwm_lowerhalf_s *dev, uint32_t car);

  /* Get current CAR value */

  uint32_t (*car_get)(struct pwm_lowerhalf_s *dev);

  /* Update CREP (counter repetition) register - advanced timers only */

  int (*crep_update)(struct pwm_lowerhalf_s *dev, uint16_t crep);

  /* Get current CREP value */

  uint16_t (*crep_get)(struct pwm_lowerhalf_s *dev);

#ifdef HAVE_TRGO
  /* Set TRGO output source */

  int (*trgo_set)(struct pwm_lowerhalf_s *dev, uint8_t trgo);
#endif

  /* Enable/disable outputs */

  int (*outputs_enable)(struct pwm_lowerhalf_s *dev, uint16_t outputs,
                        bool state);

  /* Generate software update event */

  int (*soft_update)(struct pwm_lowerhalf_s *dev);

  /* Configure timer (initial setup) */

  int (*configure)(struct pwm_lowerhalf_s *dev);

  /* Enable/disable software break (primary output enable control) */

  int (*soft_break)(struct pwm_lowerhalf_s *dev, bool state);

  /* Update PWM frequency */

  int (*freq_update)(struct pwm_lowerhalf_s *dev, uint32_t frequency);

  /* Enable/disable timer counter */

  int (*enable)(struct pwm_lowerhalf_s *dev, bool state);

#ifdef CONFIG_DEBUG_PWM_INFO
  /* Dump timer registers */

  void (*dumpregs)(struct pwm_lowerhalf_s *dev, const char *msg);
#endif

#ifdef HAVE_PWM_COMPLEMENTARY
  /* Update dead-time value */

  int (*dt_update)(struct pwm_lowerhalf_s *dev, uint8_t dt);
#endif
};

