GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_pwm.h
/* This structure provides the publicly visible representation of the
 * "lower-half" PWM driver structure for low-level operations access.
 */

struct gd32_pwm_dev_s
{
  /* The first field of this state structure must be a pointer to the PWM
   * callback structure to be consistent with upper-half PWM driver.
   */

  const struct pwm_ops_s *ops;

  /* Publicly visible portion of the "lower-half" PWM driver structure.
   * This provides access to low-level timer register operations.
   */

  const struct gd32_pwm_ops_s *llops;

  /* Require cast-compatibility with private gd32_pwmtimer_s structure */
};

#endif /* CONFIG_GD32E11X_PWM_LL_OPS */

/****************************************************************************
 * Public Data
 ****************************************************************************/

#undef EXTERN
#if defined(__cplusplus)
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_pwminitialize
 *
 * Description:
 *   Initialize one timer for use with the upper-half PWM driver.
 *
 * Input Parameters:
 *   timer - A number identifying the timer use.  The number of valid timer
 *     IDs varies with the GD32 MCU (TIMER0..TIMER4, TIMER7..TIMER13).
 *     Note: TIMER5 and TIMER6 are basic timers without PWM capability.
 *
 * Returned Value:
 *   On success, a pointer to the GD32 lower-half PWM driver is returned.
 *   NULL is returned on any failure.
 *
 ****************************************************************************/

struct pwm_lowerhalf_s *gd32_pwminitialize(int timer);

#undef EXTERN
#if defined(__cplusplus)
}
#endif

#endif /* __ASSEMBLY__ */
#endif /* __ARCH_ARM_SRC_GD32E11X_GD32E11X_PWM_H */
